grevaillot/svd_tools/headers/ATSAMR21E19A/tcc2.h
#pragma once 

/* --- TCC2: Timer Counter Control 2 -------------------------------- */

/** @defgroup tcc2_registers Timer Counter Control 2 Register
@{*/

/** TCC2_CTRLA Control A **/
#define TCC2_CTRLA			MMIO32(TCC2_BASE + 0x00)
/** TCC2_CTRLBCLR Control B Clear **/
#define TCC2_CTRLBCLR			MMIO32(TCC2_BASE + 0x04)
/** TCC2_CTRLBSET Control B Set **/
#define TCC2_CTRLBSET			MMIO32(TCC2_BASE + 0x05)
/** TCC2_SYNCBUSY Synchronization Busy **/
#define TCC2_SYNCBUSY			MMIO32(TCC2_BASE + 0x08)
/** TCC2_FCTRLA Recoverable Fault A Configuration **/
#define TCC2_FCTRLA			MMIO32(TCC2_BASE + 0x0c)
/** TCC2_FCTRLB Recoverable Fault B Configuration **/
#define TCC2_FCTRLB			MMIO32(TCC2_BASE + 0x10)
/** TCC2_WEXCTRL Waveform Extension Configuration **/
#define TCC2_WEXCTRL			MMIO32(TCC2_BASE + 0x14)
/** TCC2_DRVCTRL Driver Control **/
#define TCC2_DRVCTRL			MMIO32(TCC2_BASE + 0x18)
/** TCC2_DBGCTRL Debug Control **/
#define TCC2_DBGCTRL			MMIO32(TCC2_BASE + 0x1e)
/** TCC2_EVCTRL Event Control **/
#define TCC2_EVCTRL			MMIO32(TCC2_BASE + 0x20)
/** TCC2_INTENCLR Interrupt Enable Clear **/
#define TCC2_INTENCLR			MMIO32(TCC2_BASE + 0x24)
/** TCC2_INTENSET Interrupt Enable Set **/
#define TCC2_INTENSET			MMIO32(TCC2_BASE + 0x28)
/** TCC2_INTFLAG Interrupt Flag Status and Clear **/
#define TCC2_INTFLAG			MMIO32(TCC2_BASE + 0x2c)
/** TCC2_STATUS Status **/
#define TCC2_STATUS			MMIO32(TCC2_BASE + 0x30)
/** TCC2_COUNT Count **/
#define TCC2_COUNT			MMIO32(TCC2_BASE + 0x34)
/** TCC2_COUNT_DITH4 Count **/
#define TCC2_COUNT_DITH4			MMIO32(TCC2_BASE + 0x34)
/** TCC2_COUNT_DITH5 Count **/
#define TCC2_COUNT_DITH5			MMIO32(TCC2_BASE + 0x34)
/** TCC2_COUNT_DITH6 Count **/
#define TCC2_COUNT_DITH6			MMIO32(TCC2_BASE + 0x34)
/** TCC2_PATT Pattern **/
#define TCC2_PATT			MMIO32(TCC2_BASE + 0x38)
/** TCC2_WAVE Waveform Control **/
#define TCC2_WAVE			MMIO32(TCC2_BASE + 0x3c)
/** TCC2_PER Period **/
#define TCC2_PER			MMIO32(TCC2_BASE + 0x40)
/** TCC2_PER_DITH4 Period **/
#define TCC2_PER_DITH4			MMIO32(TCC2_BASE + 0x40)
/** TCC2_PER_DITH5 Period **/
#define TCC2_PER_DITH5			MMIO32(TCC2_BASE + 0x40)
/** TCC2_PER_DITH6 Period **/
#define TCC2_PER_DITH6			MMIO32(TCC2_BASE + 0x40)
/** TCC2_CC0 Compare and Capture **/
#define TCC2_CC0			MMIO32(TCC2_BASE + 0x44)
/** TCC2_CC0_DITH4 Compare and Capture **/
#define TCC2_CC0_DITH4			MMIO32(TCC2_BASE + 0x44)
/** TCC2_CC0_DITH5 Compare and Capture **/
#define TCC2_CC0_DITH5			MMIO32(TCC2_BASE + 0x44)
/** TCC2_CC0_DITH6 Compare and Capture **/
#define TCC2_CC0_DITH6			MMIO32(TCC2_BASE + 0x44)
/** TCC2_CC1 Compare and Capture **/
#define TCC2_CC1			MMIO32(TCC2_BASE + 0x48)
/** TCC2_CC1_DITH4 Compare and Capture **/
#define TCC2_CC1_DITH4			MMIO32(TCC2_BASE + 0x48)
/** TCC2_CC1_DITH5 Compare and Capture **/
#define TCC2_CC1_DITH5			MMIO32(TCC2_BASE + 0x48)
/** TCC2_CC1_DITH6 Compare and Capture **/
#define TCC2_CC1_DITH6			MMIO32(TCC2_BASE + 0x48)
/** TCC2_CC2 Compare and Capture **/
#define TCC2_CC2			MMIO32(TCC2_BASE + 0x4c)
/** TCC2_CC2_DITH4 Compare and Capture **/
#define TCC2_CC2_DITH4			MMIO32(TCC2_BASE + 0x4c)
/** TCC2_CC2_DITH5 Compare and Capture **/
#define TCC2_CC2_DITH5			MMIO32(TCC2_BASE + 0x4c)
/** TCC2_CC2_DITH6 Compare and Capture **/
#define TCC2_CC2_DITH6			MMIO32(TCC2_BASE + 0x4c)
/** TCC2_CC3 Compare and Capture **/
#define TCC2_CC3			MMIO32(TCC2_BASE + 0x50)
/** TCC2_CC3_DITH4 Compare and Capture **/
#define TCC2_CC3_DITH4			MMIO32(TCC2_BASE + 0x50)
/** TCC2_CC3_DITH5 Compare and Capture **/
#define TCC2_CC3_DITH5			MMIO32(TCC2_BASE + 0x50)
/** TCC2_CC3_DITH6 Compare and Capture **/
#define TCC2_CC3_DITH6			MMIO32(TCC2_BASE + 0x50)
/** TCC2_PATTB Pattern Buffer **/
#define TCC2_PATTB			MMIO32(TCC2_BASE + 0x64)
/** TCC2_WAVEB Waveform Control Buffer **/
#define TCC2_WAVEB			MMIO32(TCC2_BASE + 0x68)
/** TCC2_PERB Period Buffer **/
#define TCC2_PERB			MMIO32(TCC2_BASE + 0x6c)
/** TCC2_PERB_DITH4 Period Buffer **/
#define TCC2_PERB_DITH4			MMIO32(TCC2_BASE + 0x6c)
/** TCC2_PERB_DITH5 Period Buffer **/
#define TCC2_PERB_DITH5			MMIO32(TCC2_BASE + 0x6c)
/** TCC2_PERB_DITH6 Period Buffer **/
#define TCC2_PERB_DITH6			MMIO32(TCC2_BASE + 0x6c)
/** TCC2_CCB0 Compare and Capture Buffer **/
#define TCC2_CCB0			MMIO32(TCC2_BASE + 0x70)
/** TCC2_CCB0_DITH4 Compare and Capture Buffer **/
#define TCC2_CCB0_DITH4			MMIO32(TCC2_BASE + 0x70)
/** TCC2_CCB0_DITH5 Compare and Capture Buffer **/
#define TCC2_CCB0_DITH5			MMIO32(TCC2_BASE + 0x70)
/** TCC2_CCB0_DITH6 Compare and Capture Buffer **/
#define TCC2_CCB0_DITH6			MMIO32(TCC2_BASE + 0x70)
/** TCC2_CCB1 Compare and Capture Buffer **/
#define TCC2_CCB1			MMIO32(TCC2_BASE + 0x74)
/** TCC2_CCB1_DITH4 Compare and Capture Buffer **/
#define TCC2_CCB1_DITH4			MMIO32(TCC2_BASE + 0x74)
/** TCC2_CCB1_DITH5 Compare and Capture Buffer **/
#define TCC2_CCB1_DITH5			MMIO32(TCC2_BASE + 0x74)
/** TCC2_CCB1_DITH6 Compare and Capture Buffer **/
#define TCC2_CCB1_DITH6			MMIO32(TCC2_BASE + 0x74)
/** TCC2_CCB2 Compare and Capture Buffer **/
#define TCC2_CCB2			MMIO32(TCC2_BASE + 0x78)
/** TCC2_CCB2_DITH4 Compare and Capture Buffer **/
#define TCC2_CCB2_DITH4			MMIO32(TCC2_BASE + 0x78)
/** TCC2_CCB2_DITH5 Compare and Capture Buffer **/
#define TCC2_CCB2_DITH5			MMIO32(TCC2_BASE + 0x78)
/** TCC2_CCB2_DITH6 Compare and Capture Buffer **/
#define TCC2_CCB2_DITH6			MMIO32(TCC2_BASE + 0x78)
/** TCC2_CCB3 Compare and Capture Buffer **/
#define TCC2_CCB3			MMIO32(TCC2_BASE + 0x7c)
/** TCC2_CCB3_DITH4 Compare and Capture Buffer **/
#define TCC2_CCB3_DITH4			MMIO32(TCC2_BASE + 0x7c)
/** TCC2_CCB3_DITH5 Compare and Capture Buffer **/
#define TCC2_CCB3_DITH5			MMIO32(TCC2_BASE + 0x7c)
/** TCC2_CCB3_DITH6 Compare and Capture Buffer **/
#define TCC2_CCB3_DITH6			MMIO32(TCC2_BASE + 0x7c)

/**@}*/


/** @defgroup tcc2_ctrla CTRLA Control A
@{*/

/** TCC2_CTRLA_CPTEN3 Capture Channel 3 Enable **/
#define TCC2_CTRLA_CPTEN3		(1 << 27)
/** TCC2_CTRLA_CPTEN2 Capture Channel 2 Enable **/
#define TCC2_CTRLA_CPTEN2		(1 << 26)
/** TCC2_CTRLA_CPTEN1 Capture Channel 1 Enable **/
#define TCC2_CTRLA_CPTEN1		(1 << 25)
/** TCC2_CTRLA_CPTEN0 Capture Channel 0 Enable **/
#define TCC2_CTRLA_CPTEN0		(1 << 24)
/** TCC2_CTRLA_ALOCK Auto Lock **/
#define TCC2_CTRLA_ALOCK		(1 << 14)

