grevaillot/svd_tools/headers/ATSAMR21E19A/tcc2.h
#define TCC2_CTRLA_PRESCSYNC_SHIFT		12
#define TCC2_CTRLA_PRESCSYNC_MASK		0x03
/** @defgroup tcc2_ctrla_prescsync PRESCSYNC Prescaler and Counter Synchronization Selection
@{*/
/**@}*/

/** TCC2_CTRLA_RUNSTDBY Run in Standby **/
#define TCC2_CTRLA_RUNSTDBY		(1 << 11)

#define TCC2_CTRLA_PRESCALER_SHIFT		8
#define TCC2_CTRLA_PRESCALER_MASK		0x07
/** @defgroup tcc2_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/


#define TCC2_CTRLA_RESOLUTION_SHIFT		5
#define TCC2_CTRLA_RESOLUTION_MASK		0x03
/** @defgroup tcc2_ctrla_resolution RESOLUTION Enhanced Resolution
@{*/
/**@}*/

/** TCC2_CTRLA_ENABLE Enable **/
#define TCC2_CTRLA_ENABLE		(1 << 1)
/** TCC2_CTRLA_SWRST Software Reset **/
#define TCC2_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup tcc2_ctrlbclr CTRLBCLR Control B Clear
@{*/


#define TCC2_CTRLBCLR_CMD_SHIFT		5
#define TCC2_CTRLBCLR_CMD_MASK		0x07
/** @defgroup tcc2_ctrlbclr_cmd CMD TCC Command
@{*/
/**@}*/


#define TCC2_CTRLBCLR_IDXCMD_SHIFT		3
#define TCC2_CTRLBCLR_IDXCMD_MASK		0x03
/** @defgroup tcc2_ctrlbclr_idxcmd IDXCMD Ramp Index Command
@{*/
/**@}*/

/** TCC2_CTRLBCLR_ONESHOT One-Shot **/
#define TCC2_CTRLBCLR_ONESHOT		(1 << 2)
/** TCC2_CTRLBCLR_LUPD Lock Update **/
#define TCC2_CTRLBCLR_LUPD		(1 << 1)
/** TCC2_CTRLBCLR_DIR Counter Direction **/
#define TCC2_CTRLBCLR_DIR		(1 << 0)

/**@}*/

/** @defgroup tcc2_ctrlbset CTRLBSET Control B Set
@{*/


#define TCC2_CTRLBSET_CMD_SHIFT		5
#define TCC2_CTRLBSET_CMD_MASK		0x07
/** @defgroup tcc2_ctrlbset_cmd CMD TCC Command
@{*/
/**@}*/


#define TCC2_CTRLBSET_IDXCMD_SHIFT		3
#define TCC2_CTRLBSET_IDXCMD_MASK		0x03
/** @defgroup tcc2_ctrlbset_idxcmd IDXCMD Ramp Index Command
@{*/
/**@}*/

/** TCC2_CTRLBSET_ONESHOT One-Shot **/
#define TCC2_CTRLBSET_ONESHOT		(1 << 2)
/** TCC2_CTRLBSET_LUPD Lock Update **/
#define TCC2_CTRLBSET_LUPD		(1 << 1)
/** TCC2_CTRLBSET_DIR Counter Direction **/
#define TCC2_CTRLBSET_DIR		(1 << 0)

/**@}*/

/** @defgroup tcc2_syncbusy SYNCBUSY Synchronization Busy
@{*/

/** TCC2_SYNCBUSY_CCB3 Compare Channel Buffer 3 Busy **/
#define TCC2_SYNCBUSY_CCB3		(1 << 22)
/** TCC2_SYNCBUSY_CCB2 Compare Channel Buffer 2 Busy **/
#define TCC2_SYNCBUSY_CCB2		(1 << 21)
/** TCC2_SYNCBUSY_CCB1 Compare Channel Buffer 1 Busy **/
#define TCC2_SYNCBUSY_CCB1		(1 << 20)
/** TCC2_SYNCBUSY_CCB0 Compare Channel Buffer 0 Busy **/
#define TCC2_SYNCBUSY_CCB0		(1 << 19)
/** TCC2_SYNCBUSY_PERB Period Buffer Busy **/
#define TCC2_SYNCBUSY_PERB		(1 << 18)
/** TCC2_SYNCBUSY_WAVEB Wave Buffer Busy **/
#define TCC2_SYNCBUSY_WAVEB		(1 << 17)
/** TCC2_SYNCBUSY_PATTB Pattern Buffer Busy **/
#define TCC2_SYNCBUSY_PATTB		(1 << 16)
/** TCC2_SYNCBUSY_CC3 Compare Channel 3 Busy **/
#define TCC2_SYNCBUSY_CC3		(1 << 11)
/** TCC2_SYNCBUSY_CC2 Compare Channel 2 Busy **/
#define TCC2_SYNCBUSY_CC2		(1 << 10)
/** TCC2_SYNCBUSY_CC1 Compare Channel 1 Busy **/
#define TCC2_SYNCBUSY_CC1		(1 << 9)
/** TCC2_SYNCBUSY_CC0 Compare Channel 0 Busy **/
#define TCC2_SYNCBUSY_CC0		(1 << 8)
/** TCC2_SYNCBUSY_PER Period busy **/
#define TCC2_SYNCBUSY_PER		(1 << 7)
/** TCC2_SYNCBUSY_WAVE Wave Busy **/
#define TCC2_SYNCBUSY_WAVE		(1 << 6)
/** TCC2_SYNCBUSY_PATT Pattern Busy **/
#define TCC2_SYNCBUSY_PATT		(1 << 5)
/** TCC2_SYNCBUSY_COUNT Count Busy **/
#define TCC2_SYNCBUSY_COUNT		(1 << 4)
/** TCC2_SYNCBUSY_STATUS Status Busy **/
#define TCC2_SYNCBUSY_STATUS		(1 << 3)
/** TCC2_SYNCBUSY_CTRLB Ctrlb Busy **/
#define TCC2_SYNCBUSY_CTRLB		(1 << 2)
/** TCC2_SYNCBUSY_ENABLE Enable Busy **/
#define TCC2_SYNCBUSY_ENABLE		(1 << 1)
/** TCC2_SYNCBUSY_SWRST Swrst Busy **/
#define TCC2_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup tcc2_fctrla FCTRLA Recoverable Fault A Configuration
@{*/


#define TCC2_FCTRLA_FILTERVAL_SHIFT		24
#define TCC2_FCTRLA_FILTERVAL_MASK		0x0f
/** @defgroup tcc2_fctrla_filterval FILTERVAL Fault A Filter Value
@{*/
/**@}*/


#define TCC2_FCTRLA_BLANKVAL_SHIFT		16
#define TCC2_FCTRLA_BLANKVAL_MASK		0xff
/** @defgroup tcc2_fctrla_blankval BLANKVAL Fault A Blanking Time
@{*/
/**@}*/


#define TCC2_FCTRLA_CAPTURE_SHIFT		12
#define TCC2_FCTRLA_CAPTURE_MASK		0x07
/** @defgroup tcc2_fctrla_capture CAPTURE Fault A Capture Action
@{*/
/**@}*/


#define TCC2_FCTRLA_CHSEL_SHIFT		10
#define TCC2_FCTRLA_CHSEL_MASK		0x03
/** @defgroup tcc2_fctrla_chsel CHSEL Fault A Capture Channel
@{*/
/**@}*/


#define TCC2_FCTRLA_HALT_SHIFT		8
#define TCC2_FCTRLA_HALT_MASK		0x03
/** @defgroup tcc2_fctrla_halt HALT Fault A Halt Mode
@{*/
/**@}*/

/** TCC2_FCTRLA_RESTART Fault A Restart **/
#define TCC2_FCTRLA_RESTART		(1 << 7)

#define TCC2_FCTRLA_BLANK_SHIFT		5
#define TCC2_FCTRLA_BLANK_MASK		0x03
/** @defgroup tcc2_fctrla_blank BLANK Fault A Blanking Mode
@{*/
/**@}*/

/** TCC2_FCTRLA_QUAL Fault A Qualification **/
#define TCC2_FCTRLA_QUAL		(1 << 4)
/** TCC2_FCTRLA_KEEP Fault A Keeper **/
#define TCC2_FCTRLA_KEEP		(1 << 3)

#define TCC2_FCTRLA_SRC_SHIFT		0
#define TCC2_FCTRLA_SRC_MASK		0x03
/** @defgroup tcc2_fctrla_src SRC Fault A Source
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_fctrlb FCTRLB Recoverable Fault B Configuration
@{*/


#define TCC2_FCTRLB_FILTERVAL_SHIFT		24
#define TCC2_FCTRLB_FILTERVAL_MASK		0x0f
/** @defgroup tcc2_fctrlb_filterval FILTERVAL Fault B Filter Value
@{*/
/**@}*/


#define TCC2_FCTRLB_BLANKVAL_SHIFT		16
#define TCC2_FCTRLB_BLANKVAL_MASK		0xff
/** @defgroup tcc2_fctrlb_blankval BLANKVAL Fault B Blanking Time
@{*/
/**@}*/


#define TCC2_FCTRLB_CAPTURE_SHIFT		12
#define TCC2_FCTRLB_CAPTURE_MASK		0x07
/** @defgroup tcc2_fctrlb_capture CAPTURE Fault B Capture Action
@{*/
/**@}*/


#define TCC2_FCTRLB_CHSEL_SHIFT		10
#define TCC2_FCTRLB_CHSEL_MASK		0x03
/** @defgroup tcc2_fctrlb_chsel CHSEL Fault B Capture Channel
@{*/
/**@}*/


#define TCC2_FCTRLB_HALT_SHIFT		8
#define TCC2_FCTRLB_HALT_MASK		0x03
/** @defgroup tcc2_fctrlb_halt HALT Fault B Halt Mode
@{*/
/**@}*/

/** TCC2_FCTRLB_RESTART Fault B Restart **/
#define TCC2_FCTRLB_RESTART		(1 << 7)

#define TCC2_FCTRLB_BLANK_SHIFT		5
#define TCC2_FCTRLB_BLANK_MASK		0x03
/** @defgroup tcc2_fctrlb_blank BLANK Fault B Blanking Mode
@{*/
/**@}*/

/** TCC2_FCTRLB_QUAL Fault B Qualification **/
#define TCC2_FCTRLB_QUAL		(1 << 4)
/** TCC2_FCTRLB_KEEP Fault B Keeper **/
#define TCC2_FCTRLB_KEEP		(1 << 3)

